KubriksCodeTN/ESP32-uwb/components/lsm6dsox/lsm6dsox_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t lsm6dsox_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                          uint8_t *data,
                          uint16_t len);
int32_t lsm6dsox_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                           uint8_t *data,
                           uint16_t len);

float_t lsm6dsox_from_fs2_to_mg(int16_t lsb);
float_t lsm6dsox_from_fs4_to_mg(int16_t lsb);
float_t lsm6dsox_from_fs8_to_mg(int16_t lsb);
float_t lsm6dsox_from_fs16_to_mg(int16_t lsb);

float_t lsm6dsox_from_fs125_to_mdps(int16_t lsb);
float_t lsm6dsox_from_fs500_to_mdps(int16_t lsb);
float_t lsm6dsox_from_fs250_to_mdps(int16_t lsb);
float_t lsm6dsox_from_fs1000_to_mdps(int16_t lsb);
float_t lsm6dsox_from_fs2000_to_mdps(int16_t lsb);

float_t lsm6dsox_from_lsb_to_celsius(int16_t lsb);

float_t lsm6dsox_from_lsb_to_nsec(int16_t lsb);

typedef enum
{
  LSM6DSOX_2g   = 0,
  LSM6DSOX_16g  = 1, /* if XL_FS_MODE = ‘1’ -> LSM6DSOX_2g */
  LSM6DSOX_4g   = 2,
  LSM6DSOX_8g   = 3,
} lsm6dsox_fs_xl_t;
int32_t lsm6dsox_xl_full_scale_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_fs_xl_t val);
int32_t lsm6dsox_xl_full_scale_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_fs_xl_t *val);

typedef enum
{
  LSM6DSOX_XL_ODR_OFF    = 0,
  LSM6DSOX_XL_ODR_12Hz5  = 1,
  LSM6DSOX_XL_ODR_26Hz   = 2,
  LSM6DSOX_XL_ODR_52Hz   = 3,
  LSM6DSOX_XL_ODR_104Hz  = 4,
  LSM6DSOX_XL_ODR_208Hz  = 5,
  LSM6DSOX_XL_ODR_417Hz  = 6,
  LSM6DSOX_XL_ODR_833Hz  = 7,
  LSM6DSOX_XL_ODR_1667Hz = 8,
  LSM6DSOX_XL_ODR_3333Hz = 9,
  LSM6DSOX_XL_ODR_6667Hz = 10,
  LSM6DSOX_XL_ODR_1Hz6   = 11, /* (low power only) */
} lsm6dsox_odr_xl_t;
int32_t lsm6dsox_xl_data_rate_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_odr_xl_t val);
int32_t lsm6dsox_xl_data_rate_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_odr_xl_t *val);

typedef enum
{
  LSM6DSOX_250dps   = 0,
  LSM6DSOX_125dps   = 1,
  LSM6DSOX_500dps   = 2,
  LSM6DSOX_1000dps  = 4,
  LSM6DSOX_2000dps  = 6,
} lsm6dsox_fs_g_t;
int32_t lsm6dsox_gy_full_scale_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_fs_g_t val);
int32_t lsm6dsox_gy_full_scale_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_fs_g_t *val);

typedef enum
{
  LSM6DSOX_GY_ODR_OFF    = 0,
  LSM6DSOX_GY_ODR_12Hz5  = 1,
  LSM6DSOX_GY_ODR_26Hz   = 2,
  LSM6DSOX_GY_ODR_52Hz   = 3,
  LSM6DSOX_GY_ODR_104Hz  = 4,
  LSM6DSOX_GY_ODR_208Hz  = 5,
  LSM6DSOX_GY_ODR_417Hz  = 6,
  LSM6DSOX_GY_ODR_833Hz  = 7,
  LSM6DSOX_GY_ODR_1667Hz = 8,
  LSM6DSOX_GY_ODR_3333Hz = 9,
  LSM6DSOX_GY_ODR_6667Hz = 10,
} lsm6dsox_odr_g_t;
int32_t lsm6dsox_gy_data_rate_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_odr_g_t val);
int32_t lsm6dsox_gy_data_rate_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_odr_g_t *val);

int32_t lsm6dsox_block_data_update_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsox_block_data_update_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  LSM6DSOX_LSb_1mg  = 0,
  LSM6DSOX_LSb_16mg = 1,
} lsm6dsox_usr_off_w_t;
int32_t lsm6dsox_xl_offset_weight_set(stmdev_ctx_t *ctx,
                                      lsm6dsox_usr_off_w_t val);
int32_t lsm6dsox_xl_offset_weight_get(stmdev_ctx_t *ctx,
                                      lsm6dsox_usr_off_w_t *val);

typedef enum
{
  LSM6DSOX_HIGH_PERFORMANCE_MD  = 0,
  LSM6DSOX_LOW_NORMAL_POWER_MD  = 1,
  LSM6DSOX_ULTRA_LOW_POWER_MD   = 2,
} lsm6dsox_xl_hm_mode_t;
int32_t lsm6dsox_xl_power_mode_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_xl_hm_mode_t val);
int32_t lsm6dsox_xl_power_mode_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_xl_hm_mode_t *val);

typedef enum
{
  LSM6DSOX_GY_HIGH_PERFORMANCE  = 0,
  LSM6DSOX_GY_NORMAL            = 1,
} lsm6dsox_g_hm_mode_t;
int32_t lsm6dsox_gy_power_mode_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_g_hm_mode_t val);
int32_t lsm6dsox_gy_power_mode_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_g_hm_mode_t *val);

int32_t lsm6dsox_status_reg_get(stmdev_ctx_t *ctx,
                                lsm6dsox_status_reg_t *val);

int32_t lsm6dsox_xl_flag_data_ready_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6dsox_gy_flag_data_ready_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6dsox_temp_flag_data_ready_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t lsm6dsox_xl_usr_offset_x_set(stmdev_ctx_t *ctx,
                                     uint8_t *buff);
int32_t lsm6dsox_xl_usr_offset_x_get(stmdev_ctx_t *ctx,
                                     uint8_t *buff);

int32_t lsm6dsox_xl_usr_offset_y_set(stmdev_ctx_t *ctx,
                                     uint8_t *buff);
int32_t lsm6dsox_xl_usr_offset_y_get(stmdev_ctx_t *ctx,
                                     uint8_t *buff);

int32_t lsm6dsox_xl_usr_offset_z_set(stmdev_ctx_t *ctx,
                                     uint8_t *buff);
int32_t lsm6dsox_xl_usr_offset_z_get(stmdev_ctx_t *ctx,
                                     uint8_t *buff);

int32_t lsm6dsox_xl_usr_offset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_xl_usr_offset_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_timestamp_rst(stmdev_ctx_t *ctx);

int32_t lsm6dsox_timestamp_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_timestamp_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_timestamp_raw_get(stmdev_ctx_t *ctx, uint32_t *val);

typedef enum
{
  LSM6DSOX_NO_ROUND      = 0,
  LSM6DSOX_ROUND_XL      = 1,
  LSM6DSOX_ROUND_GY      = 2,
  LSM6DSOX_ROUND_GY_XL   = 3,
} lsm6dsox_rounding_t;
