KubriksCodeTN/ESP32-uwb/components/lsm6dsox/lsm6dsox_reg.h
typedef enum
{
  LSM6DSOX_289Hz = 0,
  LSM6DSOX_258Hz = 1,
  LSM6DSOX_120Hz = 2,
  LSM6DSOX_65Hz2 = 3,
  LSM6DSOX_33Hz2 = 4,
  LSM6DSOX_16Hz6 = 5,
  LSM6DSOX_8Hz30 = 6,
  LSM6DSOX_4Hz15 = 7,
} lsm6dsox_filter_xl_conf_ois_t;
int32_t lsm6dsox_aux_xl_bandwidth_set(stmdev_ctx_t *ctx,
                                      lsm6dsox_filter_xl_conf_ois_t val);
int32_t lsm6dsox_aux_xl_bandwidth_get(stmdev_ctx_t *ctx,
                                      lsm6dsox_filter_xl_conf_ois_t *val);

typedef enum
{
  LSM6DSOX_AUX_2g  = 0,
  LSM6DSOX_AUX_16g = 1,
  LSM6DSOX_AUX_4g  = 2,
  LSM6DSOX_AUX_8g  = 3,
} lsm6dsox_fs_xl_ois_t;
int32_t lsm6dsox_aux_xl_full_scale_set(stmdev_ctx_t *ctx,
                                       lsm6dsox_fs_xl_ois_t val);
int32_t lsm6dsox_aux_xl_full_scale_get(stmdev_ctx_t *ctx,
                                       lsm6dsox_fs_xl_ois_t *val);

typedef enum
{
  LSM6DSOX_PULL_UP_DISC       = 0,
  LSM6DSOX_PULL_UP_CONNECT    = 1,
} lsm6dsox_sdo_pu_en_t;
int32_t lsm6dsox_sdo_sa0_mode_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_sdo_pu_en_t val);
int32_t lsm6dsox_sdo_sa0_mode_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_sdo_pu_en_t *val);

typedef enum
{
  LSM6DSOX_SPI_4_WIRE = 0,
  LSM6DSOX_SPI_3_WIRE = 1,
} lsm6dsox_sim_t;
int32_t lsm6dsox_spi_mode_set(stmdev_ctx_t *ctx, lsm6dsox_sim_t val);
int32_t lsm6dsox_spi_mode_get(stmdev_ctx_t *ctx, lsm6dsox_sim_t *val);

typedef enum
{
  LSM6DSOX_I2C_ENABLE  = 0,
  LSM6DSOX_I2C_DISABLE = 1,
} lsm6dsox_i2c_disable_t;
int32_t lsm6dsox_i2c_interface_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_i2c_disable_t val);
int32_t lsm6dsox_i2c_interface_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_i2c_disable_t *val);

typedef enum
{
  LSM6DSOX_I3C_DISABLE         = 0x80,
  LSM6DSOX_I3C_ENABLE_T_50us   = 0x00,
  LSM6DSOX_I3C_ENABLE_T_2us    = 0x01,
  LSM6DSOX_I3C_ENABLE_T_1ms    = 0x02,
  LSM6DSOX_I3C_ENABLE_T_25ms   = 0x03,
} lsm6dsox_i3c_disable_t;
int32_t lsm6dsox_i3c_disable_set(stmdev_ctx_t *ctx,
                                 lsm6dsox_i3c_disable_t val);
int32_t lsm6dsox_i3c_disable_get(stmdev_ctx_t *ctx,
                                 lsm6dsox_i3c_disable_t *val);

typedef enum
{
  LSM6DSOX_PUSH_PULL                         = 0x00,
  LSM6DSOX_OPEN_DRAIN                        = 0x01,
  LSM6DSOX_INT1_NOPULL_DOWN_INT2_PUSH_PULL   = 0x02,
  LSM6DSOX_INT1_NOPULL_DOWN_INT2_OPEN_DRAIN  = 0x03,
} lsm6dsox_pp_od_t;
int32_t lsm6dsox_pin_mode_set(stmdev_ctx_t *ctx,
                              lsm6dsox_pp_od_t val);
int32_t lsm6dsox_pin_mode_get(stmdev_ctx_t *ctx,
                              lsm6dsox_pp_od_t *val);

typedef enum
{
  LSM6DSOX_ACTIVE_HIGH = 0,
  LSM6DSOX_ACTIVE_LOW  = 1,
} lsm6dsox_h_lactive_t;
int32_t lsm6dsox_pin_polarity_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_h_lactive_t val);
int32_t lsm6dsox_pin_polarity_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_h_lactive_t *val);

int32_t lsm6dsox_all_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_all_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSOX_ALL_INT_PULSED            = 0,
  LSM6DSOX_BASE_LATCHED_EMB_PULSED   = 1,
  LSM6DSOX_BASE_PULSED_EMB_LATCHED   = 2,
  LSM6DSOX_ALL_INT_LATCHED           = 3,
} lsm6dsox_lir_t;
int32_t lsm6dsox_int_notification_set(stmdev_ctx_t *ctx,
                                      lsm6dsox_lir_t val);
int32_t lsm6dsox_int_notification_get(stmdev_ctx_t *ctx,
                                      lsm6dsox_lir_t *val);

typedef enum
{
  LSM6DSOX_LSb_FS_DIV_64       = 0,
  LSM6DSOX_LSb_FS_DIV_256      = 1,
} lsm6dsox_wake_ths_w_t;
int32_t lsm6dsox_wkup_ths_weight_set(stmdev_ctx_t *ctx,
                                     lsm6dsox_wake_ths_w_t val);
int32_t lsm6dsox_wkup_ths_weight_get(stmdev_ctx_t *ctx,
                                     lsm6dsox_wake_ths_w_t *val);

int32_t lsm6dsox_wkup_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_wkup_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_xl_usr_offset_on_wkup_set(stmdev_ctx_t *ctx,
                                           uint8_t val);
int32_t lsm6dsox_xl_usr_offset_on_wkup_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dsox_wkup_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_wkup_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_gy_sleep_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_gy_sleep_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSOX_DRIVE_SLEEP_CHG_EVENT = 0,
  LSM6DSOX_DRIVE_SLEEP_STATUS    = 1,
} lsm6dsox_sleep_status_on_int_t;
int32_t lsm6dsox_act_pin_notification_set(stmdev_ctx_t *ctx,
                                          lsm6dsox_sleep_status_on_int_t val);
int32_t lsm6dsox_act_pin_notification_get(stmdev_ctx_t *ctx,
                                          lsm6dsox_sleep_status_on_int_t *val);

typedef enum
{
  LSM6DSOX_XL_AND_GY_NOT_AFFECTED      = 0,
  LSM6DSOX_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  LSM6DSOX_XL_12Hz5_GY_SLEEP           = 2,
  LSM6DSOX_XL_12Hz5_GY_PD              = 3,
} lsm6dsox_inact_en_t;
int32_t lsm6dsox_act_mode_set(stmdev_ctx_t *ctx,
                              lsm6dsox_inact_en_t val);
int32_t lsm6dsox_act_mode_get(stmdev_ctx_t *ctx,
                              lsm6dsox_inact_en_t *val);

int32_t lsm6dsox_act_sleep_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_act_sleep_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_tap_detection_on_z_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6dsox_tap_detection_on_z_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6dsox_tap_detection_on_y_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6dsox_tap_detection_on_y_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

