KubriksCodeTN/ESP32-uwb/components/lsm6dsox/lsm6dsox_reg.h
typedef enum
{
  LSM6DSOX_TEMP_NOT_BATCHED        = 0,
  LSM6DSOX_TEMP_BATCHED_AT_1Hz6    = 1,
  LSM6DSOX_TEMP_BATCHED_AT_12Hz5   = 2,
  LSM6DSOX_TEMP_BATCHED_AT_52Hz    = 3,
} lsm6dsox_odr_t_batch_t;
int32_t lsm6dsox_fifo_temp_batch_set(stmdev_ctx_t *ctx,
                                     lsm6dsox_odr_t_batch_t val);
int32_t lsm6dsox_fifo_temp_batch_get(stmdev_ctx_t *ctx,
                                     lsm6dsox_odr_t_batch_t *val);

typedef enum
{
  LSM6DSOX_NO_DECIMATION = 0,
  LSM6DSOX_DEC_1         = 1,
  LSM6DSOX_DEC_8         = 2,
  LSM6DSOX_DEC_32        = 3,
} lsm6dsox_odr_ts_batch_t;
int32_t lsm6dsox_fifo_timestamp_decimation_set(stmdev_ctx_t *ctx,
                                               lsm6dsox_odr_ts_batch_t val);
int32_t lsm6dsox_fifo_timestamp_decimation_get(stmdev_ctx_t *ctx,
                                               lsm6dsox_odr_ts_batch_t *val);

typedef enum
{
  LSM6DSOX_XL_BATCH_EVENT   = 0,
  LSM6DSOX_GYRO_BATCH_EVENT = 1,
} lsm6dsox_trig_counter_bdr_t;

typedef enum
{
  LSM6DSOX_GYRO_NC_TAG    = 1,
  LSM6DSOX_XL_NC_TAG,
  LSM6DSOX_TEMPERATURE_TAG,
  LSM6DSOX_TIMESTAMP_TAG,
  LSM6DSOX_CFG_CHANGE_TAG,
  LSM6DSOX_XL_NC_T_2_TAG,
  LSM6DSOX_XL_NC_T_1_TAG,
  LSM6DSOX_XL_2XC_TAG,
  LSM6DSOX_XL_3XC_TAG,
  LSM6DSOX_GYRO_NC_T_2_TAG,
  LSM6DSOX_GYRO_NC_T_1_TAG,
  LSM6DSOX_GYRO_2XC_TAG,
  LSM6DSOX_GYRO_3XC_TAG,
  LSM6DSOX_SENSORHUB_SLAVE0_TAG,
  LSM6DSOX_SENSORHUB_SLAVE1_TAG,
  LSM6DSOX_SENSORHUB_SLAVE2_TAG,
  LSM6DSOX_SENSORHUB_SLAVE3_TAG,
  LSM6DSOX_STEP_CPUNTER_TAG,
  LSM6DSOX_GAME_ROTATION_TAG,
  LSM6DSOX_GEOMAG_ROTATION_TAG,
  LSM6DSOX_ROTATION_TAG,
  LSM6DSOX_SENSORHUB_NACK_TAG  = 0x19,
} lsm6dsox_fifo_tag_t;
int32_t lsm6dsox_fifo_cnt_event_batch_set(stmdev_ctx_t *ctx,
                                          lsm6dsox_trig_counter_bdr_t val);
int32_t lsm6dsox_fifo_cnt_event_batch_get(stmdev_ctx_t *ctx,
                                          lsm6dsox_trig_counter_bdr_t *val);

int32_t lsm6dsox_rst_batch_counter_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsox_rst_batch_counter_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dsox_batch_counter_threshold_set(stmdev_ctx_t *ctx,
                                             uint16_t val);
int32_t lsm6dsox_batch_counter_threshold_get(stmdev_ctx_t *ctx,
                                             uint16_t *val);

int32_t lsm6dsox_fifo_data_level_get(stmdev_ctx_t *ctx,
                                     uint16_t *val);

int32_t lsm6dsox_fifo_status_get(stmdev_ctx_t *ctx,
                                 lsm6dsox_fifo_status2_t *val);

int32_t lsm6dsox_fifo_full_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_fifo_ovr_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_fifo_sensor_tag_get(stmdev_ctx_t *ctx,
                                     lsm6dsox_fifo_tag_t *val);

int32_t lsm6dsox_fifo_pedo_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_fifo_pedo_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_sh_batch_slave_0_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_batch_slave_0_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dsox_sh_batch_slave_1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_batch_slave_1_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dsox_sh_batch_slave_2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_batch_slave_2_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dsox_sh_batch_slave_3_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_batch_slave_3_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  LSM6DSOX_DEN_DISABLE    = 0,
  LSM6DSOX_LEVEL_FIFO     = 6,
  LSM6DSOX_LEVEL_LETCHED  = 3,
  LSM6DSOX_LEVEL_TRIGGER  = 2,
  LSM6DSOX_EDGE_TRIGGER   = 4,
} lsm6dsox_den_mode_t;
int32_t lsm6dsox_den_mode_set(stmdev_ctx_t *ctx,
                              lsm6dsox_den_mode_t val);
int32_t lsm6dsox_den_mode_get(stmdev_ctx_t *ctx,
                              lsm6dsox_den_mode_t *val);

typedef enum
{
  LSM6DSOX_DEN_ACT_LOW  = 0,
  LSM6DSOX_DEN_ACT_HIGH = 1,
} lsm6dsox_den_lh_t;
int32_t lsm6dsox_den_polarity_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_den_lh_t val);
int32_t lsm6dsox_den_polarity_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_den_lh_t *val);

typedef enum
{
  LSM6DSOX_STAMP_IN_GY_DATA     = 0,
  LSM6DSOX_STAMP_IN_XL_DATA     = 1,
  LSM6DSOX_STAMP_IN_GY_XL_DATA  = 2,
} lsm6dsox_den_xl_g_t;
int32_t lsm6dsox_den_enable_set(stmdev_ctx_t *ctx,
                                lsm6dsox_den_xl_g_t val);
int32_t lsm6dsox_den_enable_get(stmdev_ctx_t *ctx,
                                lsm6dsox_den_xl_g_t *val);

int32_t lsm6dsox_den_mark_axis_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_den_mark_axis_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_den_mark_axis_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_den_mark_axis_y_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_den_mark_axis_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_den_mark_axis_z_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSOX_PEDO_BASE_MODE            = 0x00,
  LSM6DSOX_FALSE_STEP_REJ            = 0x10,
  LSM6DSOX_FALSE_STEP_REJ_ADV_MODE   = 0x30,
} lsm6dsox_pedo_md_t;
int32_t lsm6dsox_pedo_sens_set(stmdev_ctx_t *ctx,
                               lsm6dsox_pedo_md_t val);
int32_t lsm6dsox_pedo_sens_get(stmdev_ctx_t *ctx,
                               lsm6dsox_pedo_md_t *val);

int32_t lsm6dsox_pedo_step_detect_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dsox_pedo_debounce_steps_set(stmdev_ctx_t *ctx,
                                         uint8_t *buff);
int32_t lsm6dsox_pedo_debounce_steps_get(stmdev_ctx_t *ctx,
                                         uint8_t *buff);

int32_t lsm6dsox_pedo_steps_period_set(stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t lsm6dsox_pedo_steps_period_get(stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t lsm6dsox_pedo_adv_detection_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6dsox_pedo_adv_detection_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6dsox_pedo_false_step_rejection_set(stmdev_ctx_t *ctx,
                                               uint8_t val);
int32_t lsm6dsox_pedo_false_step_rejection_get(stmdev_ctx_t *ctx,
                                               uint8_t *val);

